DataProcessors/ЛентаКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЛентаКартинок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПрикрепленныеФотоКОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеФотоКОбъектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтносительноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперацииМагазина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеАудитору</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.МП_ЗадачаМагазина</v8:Type>
						<v8:Type>cfg:DocumentRef.МП_ОтчетТехнолога</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеМОС</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаКачестваТоваров</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейПриложенныхКартинок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛентаКартинок/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПрикрепленныеФотоКОбъектам.Номенклатура,
	//	|	ПрикрепленныеФотоКОбъектам.Характеристика,
	//	|	ПрикрепленныеФотоКОбъектам.Объект КАК ОбъектЗаписи,
	//	|	ПрикрепленныеФотоКОбъектам.ТипЗаписи,
	//	|	ПрикрепленныеФотоКОбъектам.УинЗаписи,
	//	|	ПрикрепленныеФотоКОбъектам.ОтносительноеИмяФайла,
	//	|	ПрикрепленныеФотоКОбъектам.ДатаДобавления,
	//	|	ПрикрепленныеФотоКОбъектам.Расширение,
	//	|	ПрикрепленныеФотоКОбъектам.ТипОперацииМагазина,
	//	|	ПрикрепленныеФотоКОбъектам.ВАрхиве,
	//	|	ПрикрепленныеФотоКОбъектам.СтруктурнаяЕдиница,
	//	|	ВЫРАЗИТЬ(ПрикрепленныеФотоКОбъектам.Текст КАК СТРОКА(300)) КАК Текст
	//	|ИЗ
	//	|	РегистрСведений.ПрикрепленныеФотоКОбъектам КАК ПрикрепленныеФотоКОбъектам
	//	|ГДЕ
	//	|	ПрикрепленныеФотоКОбъектам.УинЗаписи = &УинЗаписи";

	//Запрос.УстановитьПараметр("УинЗаписи", Параметры.УинЗаписи);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	 ЗаполнитьЗначенияСвойств(ЭтаФорма,ВыборкаДетальныеЗаписи);
	////КонецЦикла;
	//УстановитьКартинкуИзФайла(ВыборкаДетальныеЗаписи);
	ИмяФайла=СтрЗаменить(Параметры.ВременныйКаталог + "\" + Параметры.УинЗаписи + "." + Параметры.Расширение, "\", "/");
КонецПроцедуры

&НаСервере
Функция УстановитьКартинкуИзФайла(ВыборкаДетальныеЗаписи);
	Если Лев(ВыборкаДетальныеЗаписи.ОтносительноеИмяФайла,2)="\\" Тогда
		КаталогКЗаписи="";
	Иначе
		КаталогКЗаписи = Константы.КаталогХраненияФайловКартинок.Получить();
		Если Прав(КаталогКЗаписи, 1) <> "\" Тогда
			КаталогКЗаписи = КаталогКЗаписи + "\";
		КонецЕсли;	
	КонецЕсли;
	
		
	К1=Константы.КаталогХраненияФайловКартинок.Получить();
	К2=Константы.МП_КаталогХраненияФайловЗадачМП.Получить();
	К3=Константы.КаталогХраненияФайлов.Получить();
	К4="\\10.0.0.51\1c$\Сертификаты";
	Если Прав(К1, 1) <> "\" Тогда
		К1 = К1 + "\";
	КонецЕсли;	
	Если Прав(К2, 1) <> "\" Тогда
		К2 = К2 + "\";
	КонецЕсли;	
	Если Прав(К3, 1) <> "\" Тогда
		К3 = К3 + "\";
	КонецЕсли;	
	Если Прав(К4, 1) <> "\" Тогда
		К4 = К4 + "\";
	КонецЕсли;	
	
    Если ЗначениеЗаполнено(КаталогКЗаписи) Тогда
	
		ИмяФайла = К1 + ВыборкаДетальныеЗаписи.ОтносительноеИмяФайла;
		ФайлКартинки=Новый Файл(ИмяФайла);
		
	
	КонецЕсли; 
	
	Если ФайлКартинки.Существует() Тогда
	Иначе
		ИмяФайла = К2 + ВыборкаДетальныеЗаписи.ОтносительноеИмяФайла;
		ФайлКартинки=Новый Файл(ИмяФайла);
		
		Если ФайлКартинки.Существует() Тогда
		Иначе
			ИмяФайла = К3 + ВыборкаДетальныеЗаписи.ОтносительноеИмяФайла;
			ФайлКартинки=Новый Файл(ИмяФайла);
			
			Если ФайлКартинки.Существует() Тогда
			Иначе
				ИмяФайла = К4 + ВыборкаДетальныеЗаписи.ОтносительноеИмяФайла;
				ФайлКартинки=Новый Файл(ИмяФайла);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ФайлКартинки.Существует() Тогда
		ПутьКартинки = ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла),ЭтаФорма.УникальныйИдентификатор);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Данные изменены. Записать?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПередЗакрытиемСервер();
			Кол=ВладелецФормы.Тэги.Количество();
			Для Сч=0 По Кол-1 Цикл
			    Если ВладелецФормы.Тэги[Кол-1-Сч].УинКартинки=УИНЗаписи Тогда
				     ВладелецФормы.Тэги.Удалить(Кол-1-Сч);
				КонецЕсли; 
			КонецЦикла;
			МассивТэгов=ВладелецФормы.РазложитьСтрокуВМассивПодстрок(Текст);
			Если МассивТэгов.Найти(Строка(Объект))=Неопределено и ЗначениеЗаполнено(Строка(Объект)) И НЕ ТипЗнч(Объект)=Тип("Строка") Тогда
				МассивТэгов.Вставить(0,Строка(Объект));
			КонецЕсли;
			Если МассивТэгов.Найти(ЗначРекв(Характеристика,"Наименование"))=Неопределено и ЗначениеЗаполнено(ЗначРекв(Характеристика,"Наименование")) Тогда
				МассивТэгов.Вставить(0,ЗначРекв(Характеристика,"Наименование"));
			КонецЕсли;
			Если МассивТэгов.Найти(ЗначРекв(Номенклатура,"Наименование"))=Неопределено и ЗначениеЗаполнено(ЗначРекв(Номенклатура,"Наименование")) Тогда
				МассивТэгов.Вставить(0,ЗначРекв(Номенклатура,"Наименование"));
			КонецЕсли;
			Для каждого Эл Из МассивТэгов Цикл
				СтрНов=ВладелецФормы.Тэги.Добавить();
				СтрНов.УинКартинки=УИНЗаписи;
				СтрНов.Тэг=Эл;
			КонецЦикла;  
			Оповестить("ОбновитьТэгиВЛентеКартинок",УИНЗаписи);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
 Функция ЗначРекв(Ссылка,Рекв)
      Возврат Ссылка[Рекв]
 КонецФункции // ()
  

&НаСервере
Процедура ПередЗакрытиемСервер()
	НЗ=РегистрыСведений.ПрикрепленныеФотоКОбъектам.СоздатьНаборЗаписей();
	НЗ.Отбор.УинЗаписи.Установить(УИНЗаписи);
	НЗ.Прочитать();
	НЗ[0].Текст=Текст;
	НЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПутьКартинки = ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла),ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры
